#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_availability_zones.all: Reading...
aws_vpc.main: Refreshing state... [id=vpc-0019a2de5322a3397]
aws_ssm_parameter.foo: Refreshing state... [id=foo]
aws_instance.ec2_instance[0]: Refreshing state... [id=i-0a7e486076d509eab]
aws_instance.ec2_instance[1]: Refreshing state... [id=i-051ae8d24ce0b4231]
aws_iam_role.role-launch-ec2: Refreshing state... [id=role-launch-ec2]
data.aws_availability_zones.all: Read complete after 1s [id=us-east-1]
aws_iam_instance_profile.ec2-instance-profile: Refreshing state... [id=ec2_instance_profile]
aws_subnet.public-subnet[0]: Refreshing state... [id=subnet-0a038ffe273e528cf]
aws_subnet.private-subnet[5]: Refreshing state... [id=subnet-0a30a8a1ceddedc4d]
aws_subnet.public-subnet[4]: Refreshing state... [id=subnet-08e6078c1c8efdfdd]
data.aws_subnet_ids.public_subnets: Reading...
aws_subnet.private-subnet[4]: Refreshing state... [id=subnet-04515c5c0cc6a3b7c]
aws_subnet.public-subnet[5]: Refreshing state... [id=subnet-0b6f663793f911886]
aws_internet_gateway.igw: Refreshing state... [id=igw-0ac123e9b2f9f6dc9]
aws_security_group.sg: Refreshing state... [id=sg-0ecf005d25660f34a]
aws_subnet.public-subnet[1]: Refreshing state... [id=subnet-084b421443cfcb750]
aws_subnet.public-subnet[2]: Refreshing state... [id=subnet-02d15ccd3b52e5319]
aws_subnet.public-subnet[3]: Refreshing state... [id=subnet-0086c7e08f9686a98]
aws_subnet.private-subnet[1]: Refreshing state... [id=subnet-04dbb45a2d8b3f2b0]
data.aws_subnet_ids.public_subnets: Read complete after 1s [id=vpc-0019a2de5322a3397]
aws_subnet.private-subnet[0]: Refreshing state... [id=subnet-098d6efe9b7c412e0]
aws_subnet.private-subnet[2]: Refreshing state... [id=subnet-04907e983cda8b829]
aws_subnet.private-subnet[3]: Refreshing state... [id=subnet-0913fab23c6fc946e]
aws_route.public_subnets_igw[5]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[1]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[2]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[3]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[0]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[4]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_launch_configuration.alc: Refreshing state... [id=remix-recipe-prod-lc]
aws_route_table_association.public_subnets_association[1]: Refreshing state... [id=rtbassoc-0fac2590760fc4c4b]
aws_route_table_association.public_subnets_association[2]: Refreshing state... [id=rtbassoc-0e0468fb16730045c]
aws_route_table_association.public_subnets_association[5]: Refreshing state... [id=rtbassoc-0802b8fa82971a529]
aws_route_table_association.public_subnets_association[0]: Refreshing state... [id=rtbassoc-008c4bd80a2938c9f]
aws_elb.elb: Refreshing state... [id=remix-recipe-server-elb]
aws_route_table_association.public_subnets_association[3]: Refreshing state... [id=rtbassoc-0e0f58fc63e546404]
aws_route_table_association.public_subnets_association[4]: Refreshing state... [id=rtbassoc-0a29256b27cc8d765]
aws_autoscaling_group.asg: Refreshing state... [id=remix-recipe-prod-asg]
aws_autoscaling_attachment.asg_elb: Refreshing state... [id=remix-recipe-prod-asg-20230206214304365000000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_group.asg will be updated in-place
  ~ resource "aws_autoscaling_group" "asg" {
      ~ force_delete              = false -> true
        id                        = "remix-recipe-prod-asg"
      ~ load_balancers            = [
          - "remix-recipe-server-elb",
        ]
        name                      = "remix-recipe-prod-asg"
        # (21 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_instance.ec2_instance[0] will be destroyed
  # (because aws_instance.ec2_instance is not in configuration)
  - resource "aws_instance" "ec2_instance" {
      - ami                                  = "ami-0323c3dd2da7fb37d" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:619568494776:instance/i-0a7e486076d509eab" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "us-east-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "ec2_instance_profile" -> null
      - id                                   = "i-0a7e486076d509eab" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-0656a43b9ba1180bc" -> null
      - private_dns                          = "ip-10-0-1-12.ec2.internal" -> null
      - private_ip                           = "10.0.1.12" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0a038ffe273e528cf" -> null
      - tags                                 = {
          - "Environment" = "Production"
          - "Name"        = "remix-recipe-prod-instance-1"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                             = {
          - "Environment" = "Production"
          - "Name"        = "remix-recipe-prod-instance-1"
          - "Owner"       = "Shubham"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "1730b2b79f7734dee81cdeef1620aef2181e1cac" -> null
      - vpc_security_group_ids               = [
          - "sg-0ecf005d25660f34a",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-004a651eb7c352c0c" -> null
          - volume_size           = 30 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.ec2_instance[1] will be destroyed
  # (because aws_instance.ec2_instance is not in configuration)
  - resource "aws_instance" "ec2_instance" {
      - ami                                  = "ami-0323c3dd2da7fb37d" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:619568494776:instance/i-051ae8d24ce0b4231" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "us-east-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "ec2_instance_profile" -> null
      - id                                   = "i-051ae8d24ce0b4231" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-0d30f750c354c51c3" -> null
      - private_dns                          = "ip-10-0-1-31.ec2.internal" -> null
      - private_ip                           = "10.0.1.31" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0a038ffe273e528cf" -> null
      - tags                                 = {
          - "Environment" = "Production"
          - "Name"        = "remix-recipe-prod-instance-2"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                             = {
          - "Environment" = "Production"
          - "Name"        = "remix-recipe-prod-instance-2"
          - "Owner"       = "Shubham"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "1730b2b79f7734dee81cdeef1620aef2181e1cac" -> null
      - vpc_security_group_ids               = [
          - "sg-0ecf005d25660f34a",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-090ead2d4b5f5e50b" -> null
          - volume_size           = 30 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_launch_configuration.alc must be replaced
-/+ resource "aws_launch_configuration" "alc" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:619568494776:launchConfiguration:4fcce13e-2253-49db-8489-b533c3b906fc:launchConfigurationName/remix-recipe-prod-lc" -> (known after apply)
      ~ associate_public_ip_address      = false -> true # forces replacement
      ~ ebs_optimized                    = false -> (known after apply)
      + iam_instance_profile             = "ec2_instance_profile" # forces replacement
      ~ id                               = "remix-recipe-prod-lc" -> (known after apply)
      + key_name                         = (known after apply)
        name                             = "remix-recipe-prod-lc"
      + name_prefix                      = (known after apply)
      + user_data                        = "1730b2b79f7734dee81cdeef1620aef2181e1cac" # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (4 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true # forces replacement
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = 30 # forces replacement
          + volume_type           = "gp2" # forces replacement
        }
    }

Plan: 1 to add, 1 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @shubhamcommits, Action: `pull_request`*